app/views/orders/new.html.haml

SELECT "universities".* FROM "universities"
---
  =f.label :university_id
  =f.select :university_id, options_from_collection_for_select(University.all, :id, :name)