app/controllers/cakes_controller.rb

  def create
    @cake = Cake.new params[:cake]

    if @cake.save
---
INSERT INTO "cakes" ("created_at", "flavor", "frosting", "message", "name", "price", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)